Revit 2024 API
BasicFileInfo Methods
The BasicFileInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Extract
 Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
GetDocumentVersion
 Gets the DocumentVersion for the file.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace